max_lenge = 0                               # กำหนดเป็นตัวแปร global เพื่อใช้งานในฟังก์ชัน

# ฟังก์ชันที่ใช้ในการปรับข้อมูลเพื่อ sort หาตำแหน่ง โดยที่ไม่ได้มีการแก้ไขข้อมูลใน list ที่ส่งเข้ามาจริงๆ
def myfunc(n):                              # รับค่า string เข้ามาทีละตัว
    while(len(n) < max_lenge):              # เช็คว่าความยาวของ string แต่ละค่ามีความยาวเท่ากับความยาวสูงสุดหรือไม่
        n += n[0]                           # หากความยาวไม่เท่า ทำการเพิ่มค่าตำแหน่งแรกต่อท้าย string
    return n                                # ส่งค่า n ใหม่กลับไปเพื่อใช้ในการ sorting

# การรับค่าเข้ามา และจัดรูปแบบข้อมูลเบื้องต้น    
input_string = input("Enter elements of a list separated by space : ")
num_list = list(input_string.split())                   # ปรับให้ค่าที่รับเข้ามาเป็น list 
max_lenge = len(str(max(int(n) for n in num_list)))     # หาความยาวของ string ที่มากที่สุด

# ทำการเรียงลำดับของ string จากมากไปน้อย โดยจะทำการส่ง list ไปทำการปรับข้อมูลก่อนเพื่อให้ sorting ได้ตามที่ต้องการ
num_list.sort(key = myfunc, reverse = True) # โดย output ที่ได้จะเป็น list ของข้อมูลที่ไม่ได้ถูกปรับแก้ 

for i in num_list:                          # วนลูปตามค่าใน list ที่ทำการเรียงแล้ว
   print(i,end="")                          # แสดงผลค่าของ string ใน list แต่ละตัวตามลำดับติดกัน
  
   
'''
1. รับค่าตัวเลขเข้ามาบรรทัดเดียว โดยแต่ละค่าทำการเว้น 1 ช่อง
2. นำค่าที่รับมา ทำการแยกค่าออกจากกันเป็น list
3. นำค่าที่รับเข้ามาเติมค่าตัวเลขแรกของตัวมันเอง ให้เท่ากับความยาวของ string ใน list ที่มีความยาวมากที่สุด
4. นำค่านั้นมาทำการ sort โดยเรียงจากมากไปน้อย
5. แสดงผลโดยให้ค่าแสดงผลต่อกันครบ
'''
